Revit 2026 API

# RenderingSettingsSetRenderingQualitySettings Method

---

Change rendering quality settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetRenderingQualitySettings(
	RenderingQualitySettings settings
)
```
```vb
Public Sub SetRenderingQualitySettings (
	settings As RenderingQualitySettings
)
```
```cpp
public:
void SetRenderingQualitySettings(
	RenderingQualitySettings^ settings
)
```
```fsharp
member SetRenderingQualitySettings :
        settings : RenderingQualitySettings -> unit
```

#### Parameters

settings RenderingQualitySettings
     An instance of the new rendering quality settings.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace